performance/mysql8-jemalloc-profiling/logs/2021-08-31/jemalloc521-profiling_19_26.run.oltp_read_only.128.2021-08-31_073624.log
sysbench 1.0.20 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 128
Report intermediate results every 1 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

1,128,15875.09,255268.02,223392.47,0.00,31875.55,10.46,0.00,0.00
2,128,16459.14,263469.21,230549.93,0.00,32919.27,9.73,0.00,0.00
3,128,16490.43,263797.93,230816.07,0.00,32981.86,9.56,0.00,0.00
4,128,16480.84,263741.53,230782.84,0.00,32958.69,8.43,0.00,0.00
5,128,16488.71,263793.42,230816.99,0.00,32976.43,8.43,0.00,0.00
6,128,16484.19,263733.97,230762.60,0.00,32971.37,8.43,0.00,0.00
7,128,16480.98,263744.62,230785.66,0.00,32958.95,8.43,0.00,0.00
8,128,16490.42,263745.67,230764.83,0.00,32980.83,8.43,0.00,0.00
9,128,16484.72,263768.51,230802.07,0.00,32966.44,8.43,0.00,0.00
10,128,16476.61,263630.71,230675.50,0.00,32955.21,8.43,0.00,0.00
11,128,16476.71,263601.30,230646.88,0.00,32954.41,8.43,0.00,0.00
12,128,16482.68,263717.93,230752.57,0.00,32965.37,8.43,0.00,0.00
13,128,16476.79,263699.64,230745.06,0.00,32954.58,8.43,0.00,0.00
14,128,16465.23,263416.65,230487.19,0.00,32929.46,8.43,0.00,0.00
15,128,16471.64,263534.18,230586.91,0.00,32947.27,8.43,0.00,0.00
16,128,16474.17,263546.71,230603.37,0.00,32943.34,8.43,0.00,0.00
17,128,16473.10,263654.59,230706.39,0.00,32948.20,8.43,0.00,0.00
18,128,16477.56,263617.90,230661.79,0.00,32956.11,8.43,0.00,0.00
19,128,16480.95,263718.17,230756.28,0.00,32961.90,8.43,0.00,0.00
20,128,16482.57,263687.05,230720.92,0.00,32966.13,8.43,0.00,0.00
21,128,16471.91,263535.57,230595.75,0.00,32939.82,8.43,0.00,0.00
22,128,16484.12,263796.88,230827.65,0.00,32969.23,8.43,0.00,0.00
23,128,16485.64,263711.29,230741.01,0.00,32970.29,8.43,0.00,0.00
24,128,16475.55,263656.80,230702.70,0.00,32954.10,8.43,0.00,0.00
25,128,16490.15,263818.39,230836.09,0.00,32982.30,8.43,0.00,0.00
26,128,16519.98,264304.62,231267.67,0.00,33036.95,8.43,0.00,0.00
27,128,16522.50,264389.08,231342.07,0.00,33047.01,8.43,0.00,0.00
28,128,16526.00,264427.93,231375.94,0.00,33051.99,8.43,0.00,0.00
29,128,16513.36,264196.83,231174.10,0.00,33022.73,8.43,0.00,0.00
30,128,16517.40,264251.48,231212.67,0.00,33038.81,8.43,0.00,0.00
31,128,16509.55,264211.73,231195.64,0.00,33016.09,8.43,0.00,0.00
32,128,16517.21,264251.43,231214.00,0.00,33037.43,8.43,0.00,0.00
33,128,16509.06,264148.01,231130.89,0.00,33017.13,8.43,0.00,0.00
34,128,16517.32,264230.12,231196.48,0.00,33033.64,8.43,0.00,0.00
35,128,16510.08,264142.26,231121.11,0.00,33021.16,8.43,0.00,0.00
36,128,16487.86,263838.84,230862.11,0.00,32976.73,8.43,0.00,0.00
37,128,16507.45,264087.28,231076.37,0.00,33010.91,8.43,0.00,0.00
38,128,16508.02,264057.29,231042.25,0.00,33015.04,8.43,0.00,0.00
39,128,16475.25,263739.02,230784.52,0.00,32954.50,8.43,0.00,0.00
40,128,16489.46,263768.34,230793.42,0.00,32974.92,8.43,0.00,0.00
41,128,16479.59,263714.51,230755.32,0.00,32959.19,8.43,0.00,0.00
42,128,16495.34,263907.44,230912.76,0.00,32994.68,8.43,0.00,0.00
43,128,16481.90,263726.43,230762.62,0.00,32963.80,8.43,0.00,0.00
44,128,16470.05,263533.74,230591.65,0.00,32942.09,8.43,0.00,0.00
45,128,16472.09,263622.49,230683.31,0.00,32939.19,8.43,0.00,0.00
46,128,16484.71,263770.40,230798.98,0.00,32971.43,8.43,0.00,0.00
47,128,16484.28,263689.43,230724.88,0.00,32964.55,8.43,0.00,0.00
48,128,16482.57,263732.16,230764.02,0.00,32968.15,8.43,0.00,0.00
49,128,16496.27,263863.31,230872.77,0.00,32990.54,8.43,0.00,0.00
50,128,16474.01,263679.22,230727.20,0.00,32952.03,8.43,0.00,0.00
51,128,16478.32,263611.13,230656.49,0.00,32954.64,8.43,0.00,0.00
52,128,16480.54,263702.68,230737.59,0.00,32965.08,8.43,0.00,0.00
53,128,16491.59,263861.52,230881.33,0.00,32980.19,8.43,0.00,0.00
54,128,16481.34,263667.52,230705.83,0.00,32961.69,8.43,0.00,0.00
55,128,16479.65,263636.36,230672.07,0.00,32964.30,8.43,0.00,0.00
56,128,16477.68,263729.92,230775.55,0.00,32954.37,8.43,0.00,0.00
57,128,16476.15,263578.46,230626.15,0.00,32952.31,8.43,0.00,0.00
58,128,16486.93,263821.84,230847.99,0.00,32973.86,8.43,0.00,0.00
59,128,16481.35,263669.58,230708.88,0.00,32960.70,8.43,0.00,0.00
60,128,16476.27,263676.28,230726.75,0.00,32949.54,8.43,0.00,0.00
61,128,16473.17,263577.74,230627.40,0.00,32950.34,8.43,0.00,0.00
62,128,16500.52,263800.33,230801.28,0.00,32999.04,8.43,0.00,0.00
63,128,16475.35,263719.54,230768.85,0.00,32950.70,8.43,0.00,0.00
64,128,16487.23,263741.69,230770.23,0.00,32971.46,8.43,0.00,0.00
65,128,16486.86,263808.69,230833.98,0.00,32974.71,8.43,0.00,0.00
66,128,16483.64,263788.29,230817.00,0.00,32971.29,8.43,0.00,0.00
67,128,16481.68,263620.91,230660.54,0.00,32960.36,8.43,0.00,0.00
68,128,16486.55,263849.80,230874.70,0.00,32975.10,8.43,0.00,0.00
69,128,16478.70,263713.26,230757.85,0.00,32955.41,8.43,0.00,0.00
70,128,16487.82,263780.11,230805.47,0.00,32974.64,8.43,0.00,0.00
71,128,16491.33,263803.26,230820.60,0.00,32982.66,8.43,0.00,0.00
72,128,16484.95,263825.23,230855.33,0.00,32969.90,8.43,0.00,0.00
73,128,16483.37,263725.89,230758.16,0.00,32967.74,8.43,0.00,0.00
74,128,16485.00,263777.98,230809.98,0.00,32968.00,8.43,0.00,0.00
75,128,16480.29,263682.68,230719.09,0.00,32963.58,8.43,0.00,0.00
76,128,16493.67,263808.73,230823.39,0.00,32985.34,8.43,0.00,0.00
77,128,16477.73,263741.65,230785.20,0.00,32956.46,8.43,0.00,0.00
78,128,16483.13,263712.14,230742.87,0.00,32969.27,8.43,0.00,0.00
79,128,16478.57,263607.15,230654.00,0.00,32953.14,8.43,0.00,0.00
80,128,16489.21,263787.36,230805.94,0.00,32981.42,8.43,0.00,0.00
81,128,16469.23,263566.60,230631.15,0.00,32935.45,8.43,0.00,0.00
82,128,16490.02,263813.31,230834.27,0.00,32979.04,8.43,0.00,0.00
83,128,16488.20,263807.27,230830.86,0.00,32976.41,8.43,0.00,0.00
84,128,16482.46,263779.34,230811.42,0.00,32967.92,8.43,0.00,0.00
85,128,16480.43,263682.92,230722.05,0.00,32960.86,8.43,0.00,0.00
86,128,16502.55,263940.82,230933.72,0.00,33007.10,8.43,0.00,0.00
87,128,16474.38,263694.14,230749.38,0.00,32944.77,8.43,0.00,0.00
88,128,16479.36,263602.74,230646.02,0.00,32956.72,8.43,0.00,0.00
89,128,16479.17,263686.67,230725.34,0.00,32961.33,8.43,0.00,0.00
90,128,16484.78,263720.41,230749.86,0.00,32970.55,8.43,0.00,0.00
91,128,16476.37,263740.95,230786.20,0.00,32954.74,8.43,0.00,0.00
92,128,16473.27,263563.30,230617.76,0.00,32945.54,8.43,0.00,0.00
93,128,16485.01,263729.09,230760.08,0.00,32969.01,8.43,0.00,0.00
94,128,16480.67,263702.66,230741.32,0.00,32961.33,8.43,0.00,0.00
95,128,16476.90,263634.46,230683.66,0.00,32950.81,8.43,0.00,0.00
96,128,16482.53,263708.43,230738.37,0.00,32970.05,8.43,0.00,0.00
97,128,16492.01,263757.23,230772.21,0.00,32985.03,8.43,0.00,0.00
98,128,16481.02,263798.31,230839.27,0.00,32959.04,8.43,0.00,0.00
99,128,16482.50,263715.02,230749.02,0.00,32966.00,8.43,0.00,0.00
100,128,16484.12,263726.92,230758.68,0.00,32968.24,8.43,0.00,0.00
101,128,16485.00,263708.03,230742.03,0.00,32966.00,8.43,0.00,0.00
102,128,16477.72,263722.49,230762.06,0.00,32960.44,8.43,0.00,0.00
103,128,16477.03,263701.45,230750.39,0.00,32951.06,8.43,0.00,0.00
104,128,16486.39,263687.27,230715.49,0.00,32971.78,8.43,0.00,0.00
105,128,16480.61,263762.83,230799.60,0.00,32963.23,8.43,0.00,0.00
106,128,16482.25,263631.95,230664.46,0.00,32967.50,8.43,0.00,0.00
107,128,16481.56,263708.97,230748.85,0.00,32960.12,8.43,0.00,0.00
108,128,16479.89,263705.17,230744.40,0.00,32960.77,8.43,0.00,0.00
109,128,16486.07,263732.06,230764.93,0.00,32967.13,8.43,0.00,0.00
110,128,16479.43,263743.82,230777.97,0.00,32965.85,8.43,0.00,0.00
111,128,16495.03,263937.50,230950.44,0.00,32987.06,8.43,0.00,0.00
112,128,16472.46,263482.41,230537.48,0.00,32944.93,8.43,0.00,0.00
113,128,16479.28,263696.50,230738.94,0.00,32957.56,8.43,0.00,0.00
114,128,16480.86,263618.82,230657.09,0.00,32961.73,8.43,0.00,0.00
115,128,16464.97,263650.50,230719.57,0.00,32930.93,8.43,0.00,0.00
116,128,16492.06,263761.94,230777.82,0.00,32984.12,8.43,0.00,0.00
117,128,16484.96,263760.43,230788.50,0.00,32971.93,8.43,0.00,0.00
118,128,16476.26,263668.14,230715.63,0.00,32952.52,8.43,0.00,0.00
119,128,16488.98,263778.66,230800.71,0.00,32977.96,8.43,0.00,0.00
120,128,16476.89,263657.27,230706.48,0.00,32950.78,8.43,0.00,0.00
121,128,16483.48,263777.74,230808.77,0.00,32968.97,8.43,0.00,0.00
122,128,16487.79,263740.60,230764.02,0.00,32976.58,8.43,0.00,0.00
123,128,16485.79,263685.70,230714.12,0.00,32971.59,8.43,0.00,0.00
124,128,16488.88,263885.02,230909.27,0.00,32975.75,8.43,0.00,0.00
125,128,16494.50,263866.95,230879.96,0.00,32986.99,8.43,0.00,0.00
126,128,16472.49,263670.88,230723.89,0.00,32946.98,8.43,0.00,0.00
127,128,16479.38,263681.10,230719.34,0.00,32961.76,8.43,0.00,0.00
128,128,16479.76,263603.21,230648.68,0.00,32954.53,8.43,0.00,0.00
129,128,16472.21,263580.30,230632.89,0.00,32947.41,8.43,0.00,0.00
130,128,16480.26,263659.17,230698.65,0.00,32960.52,8.43,0.00,0.00
131,128,16489.60,263869.60,230889.40,0.00,32980.20,8.43,0.00,0.00
132,128,16484.92,263716.69,230749.85,0.00,32966.84,8.43,0.00,0.00
133,128,16488.10,263752.56,230780.37,0.00,32972.19,8.43,0.00,0.00
134,128,16485.15,263858.40,230880.10,0.00,32978.30,8.43,0.00,0.00
135,128,16487.48,263757.76,230784.79,0.00,32972.97,8.43,0.00,0.00
136,128,16487.85,263800.59,230825.89,0.00,32974.70,8.43,0.00,0.00
137,128,16477.34,263681.41,230724.73,0.00,32956.68,8.43,0.00,0.00
138,128,16464.60,263308.53,230379.34,0.00,32929.19,8.43,0.00,0.00
139,128,16469.88,263675.06,230737.30,0.00,32937.76,8.43,0.00,0.00
140,128,16483.75,263759.01,230790.51,0.00,32968.50,8.43,0.00,0.00
141,128,16492.93,263762.85,230778.99,0.00,32983.85,8.43,0.00,0.00
142,128,16481.56,263776.02,230812.89,0.00,32963.13,8.43,0.00,0.00
143,128,16481.62,263643.94,230680.70,0.00,32963.24,8.43,0.00,0.00
144,128,16470.51,263619.12,230678.11,0.00,32941.02,8.43,0.00,0.00
145,128,16478.89,263715.26,230754.47,0.00,32960.78,8.43,0.00,0.00
146,128,16493.47,263800.56,230815.62,0.00,32984.95,8.43,0.00,0.00
147,128,16480.93,263675.80,230711.95,0.00,32963.85,8.43,0.00,0.00
148,128,16487.93,263763.93,230790.07,0.00,32973.87,8.43,0.00,0.00
149,128,16482.01,263707.16,230742.14,0.00,32965.02,8.43,0.00,0.00
150,128,16477.48,263679.70,230725.74,0.00,32953.96,8.43,0.00,0.00
151,128,16485.88,263726.01,230752.26,0.00,32973.75,8.43,0.00,0.00
152,128,16484.88,263804.05,230840.30,0.00,32963.76,8.43,0.00,0.00
153,128,16491.00,263787.97,230801.98,0.00,32985.99,8.43,0.00,0.00
154,128,16472.88,263746.17,230799.40,0.00,32946.77,8.43,0.00,0.00
155,128,16480.36,263683.83,230721.10,0.00,32962.73,8.43,0.00,0.00
156,128,16491.09,263700.49,230720.30,0.00,32980.19,8.43,0.00,0.00
157,128,16482.11,263785.73,230821.52,0.00,32964.22,8.43,0.00,0.00
158,128,16485.29,263700.66,230732.07,0.00,32968.58,8.43,0.00,0.00
159,128,16481.41,263757.64,230792.81,0.00,32964.83,8.43,0.00,0.00
160,128,16491.68,263894.94,230914.57,0.00,32980.37,8.43,0.00,0.00
161,128,16477.04,263557.61,230603.54,0.00,32954.08,8.43,0.00,0.00
162,128,16482.26,263764.15,230795.63,0.00,32968.52,8.43,0.00,0.00
163,128,16494.92,263898.79,230914.94,0.00,32983.85,8.43,0.00,0.00
164,128,16475.04,263637.57,230681.50,0.00,32956.07,8.43,0.00,0.00
165,128,16482.53,263725.49,230760.43,0.00,32965.06,8.43,0.00,0.00
166,128,16485.66,263793.63,230823.30,0.00,32970.33,8.43,0.00,0.00
167,128,16506.75,263977.05,230962.54,0.00,33014.51,8.43,0.00,0.00
168,128,16476.54,263722.56,230770.49,0.00,32952.07,8.43,0.00,0.00
169,128,16483.67,263754.76,230789.41,0.00,32965.34,8.43,0.00,0.00
170,128,16488.60,263778.54,230802.35,0.00,32976.19,8.43,0.00,0.00
171,128,16497.90,263919.45,230919.64,0.00,32999.81,8.43,0.00,0.00
172,128,16491.90,263865.42,230882.62,0.00,32982.80,8.43,0.00,0.00
173,128,16471.30,263673.77,230728.17,0.00,32945.60,8.43,0.00,0.00
174,128,16484.06,263561.97,230598.85,0.00,32963.12,8.43,0.00,0.00
175,128,16470.85,263732.61,230790.91,0.00,32941.71,8.43,0.00,0.00
176,128,16497.84,263888.37,230890.70,0.00,32997.67,8.43,0.00,0.00
177,128,16482.13,263665.01,230701.75,0.00,32963.25,8.43,0.00,0.00
178,128,16485.40,263745.38,230774.58,0.00,32970.80,8.43,0.00,0.00
179,128,16485.97,263802.48,230831.55,0.00,32970.94,8.43,0.00,0.00
180,128,16482.19,263796.02,230828.64,0.00,32967.38,8.43,0.00,0.00
181,128,16470.01,263441.18,230503.16,0.00,32938.03,8.43,0.00,0.00
182,128,16477.91,263727.60,230773.77,0.00,32953.83,8.43,0.00,0.00
183,128,16489.30,263768.84,230786.24,0.00,32982.61,8.43,0.00,0.00
184,128,16491.45,263872.14,230891.25,0.00,32980.89,8.43,0.00,0.00
185,128,16491.65,263799.43,230817.12,0.00,32982.30,8.43,0.00,0.00
186,128,16489.10,263808.54,230830.35,0.00,32978.19,8.43,0.00,0.00
187,128,16480.01,263817.21,230857.19,0.00,32960.02,8.43,0.00,0.00
188,128,16480.75,263612.01,230646.51,0.00,32965.50,8.43,0.00,0.00
189,128,16481.42,263731.77,230769.93,0.00,32961.84,8.43,0.00,0.00
190,128,16489.78,263740.48,230762.92,0.00,32977.56,8.43,0.00,0.00
191,128,16468.62,263503.85,230572.62,0.00,32931.23,8.43,0.00,0.00
192,128,16470.81,263527.98,230585.36,0.00,32942.62,8.43,0.00,0.00
193,128,16479.25,263790.07,230825.56,0.00,32964.51,8.43,0.00,0.00
194,128,16483.26,263667.15,230703.63,0.00,32963.52,8.43,0.00,0.00
195,128,16487.70,263812.18,230834.78,0.00,32977.40,8.43,0.00,0.00
196,128,16480.37,263715.92,230755.18,0.00,32960.74,8.43,0.00,0.00
197,128,16465.20,263478.16,230545.76,0.00,32932.39,8.43,0.00,0.00
198,128,16469.08,263490.28,230551.12,0.00,32939.16,8.43,0.00,0.00
199,128,16482.60,263718.60,230753.40,0.00,32965.20,8.43,0.00,0.00
200,128,16475.54,263531.70,230586.61,0.00,32945.09,8.43,0.00,0.00
201,128,16478.77,263630.33,230674.79,0.00,32955.54,8.43,0.00,0.00
202,128,16480.41,263766.48,230801.67,0.00,32964.81,8.43,0.00,0.00
203,128,16499.80,263889.75,230889.16,0.00,33000.59,8.43,0.00,0.00
204,128,16476.93,263713.89,230761.03,0.00,32952.86,8.43,0.00,0.00
205,128,16480.91,263678.51,230715.70,0.00,32962.81,8.43,0.00,0.00
206,128,16498.18,263955.86,230961.50,0.00,32994.36,8.43,0.00,0.00
207,128,16517.57,264384.19,231344.04,0.00,33040.15,8.43,0.00,0.00
208,128,16505.40,264099.44,231088.64,0.00,33010.81,8.43,0.00,0.00
209,128,16512.24,264119.82,231096.34,0.00,33023.48,8.43,0.00,0.00
210,128,16518.78,264307.51,231271.95,0.00,33035.56,8.43,0.00,0.00
211,128,16512.67,264220.73,231194.39,0.00,33026.34,8.43,0.00,0.00
212,128,16512.73,264189.67,231164.21,0.00,33025.46,8.43,0.00,0.00
213,128,16500.88,264035.01,231036.25,0.00,32998.75,8.43,0.00,0.00
214,128,16521.38,264230.08,231184.32,0.00,33045.76,8.43,0.00,0.00
215,128,16509.49,264177.82,231159.85,0.00,33017.98,8.43,0.00,0.00
216,128,16507.07,264156.12,231141.98,0.00,33014.14,8.43,0.00,0.00
217,128,16506.35,264197.56,231181.87,0.00,33015.69,8.43,0.00,0.00
218,128,16476.16,263570.48,230620.17,0.00,32950.31,8.43,0.00,0.00
219,128,16492.37,263957.89,230972.15,0.00,32985.74,8.43,0.00,0.00
220,128,16493.55,263858.82,230873.72,0.00,32985.10,8.43,0.00,0.00
221,128,16494.06,263891.98,230903.85,0.00,32988.12,8.43,0.00,0.00
222,128,16506.44,264013.09,231000.21,0.00,33012.89,8.43,0.00,0.00
223,128,16491.34,263954.45,230971.77,0.00,32982.68,8.43,0.00,0.00
224,128,16492.67,263789.68,230803.35,0.00,32986.33,8.43,0.00,0.00
225,128,16476.71,263635.32,230686.91,0.00,32948.41,8.43,0.00,0.00
226,128,16479.45,263737.13,230773.24,0.00,32963.89,8.43,0.00,0.00
227,128,16480.80,263680.77,230723.18,0.00,32957.60,8.43,0.00,0.00
228,128,16487.35,263699.57,230720.87,0.00,32978.70,8.43,0.00,0.00
229,128,16477.23,263651.70,230698.24,0.00,32953.46,8.43,0.00,0.00
230,128,16469.77,263577.40,230637.85,0.00,32939.55,8.43,0.00,0.00
231,128,16489.58,263855.27,230876.11,0.00,32979.16,8.43,0.00,0.00
232,128,16486.67,263739.72,230765.38,0.00,32974.34,8.43,0.00,0.00
233,128,16487.71,263807.38,230830.96,0.00,32976.42,8.43,0.00,0.00
234,128,16477.32,263634.20,230679.55,0.00,32954.65,8.43,0.00,0.00
235,128,16492.25,263873.97,230890.48,0.00,32983.50,8.43,0.00,0.00
236,128,16491.42,263905.73,230922.89,0.00,32982.84,8.43,0.00,0.00
237,128,16478.19,263640.06,230683.68,0.00,32956.38,8.43,0.00,0.00
238,128,16478.18,263660.84,230706.48,0.00,32954.35,8.43,0.00,0.00
239,128,16490.91,263795.62,230816.80,0.00,32978.83,8.43,0.00,0.00
240,128,16490.66,263881.50,230895.19,0.00,32986.31,8.43,0.00,0.00
241,128,16479.29,263648.69,230690.10,0.00,32958.59,8.43,0.00,0.00
242,128,16475.54,263630.71,230682.62,0.00,32948.09,8.43,0.00,0.00
243,128,16486.56,263779.99,230809.86,0.00,32970.12,8.43,0.00,0.00
244,128,16477.19,263622.02,230662.64,0.00,32959.38,8.43,0.00,0.00
245,128,16479.50,263771.92,230812.93,0.00,32958.99,8.43,0.00,0.00
246,128,16499.72,263874.45,230872.02,0.00,33002.43,8.43,0.00,0.00
247,128,16474.88,263686.10,230737.33,0.00,32948.76,8.43,0.00,0.00
248,128,16484.85,263691.58,230723.88,0.00,32967.70,8.43,0.00,0.00
249,128,16498.31,263917.90,230923.29,0.00,32994.61,8.43,0.00,0.00
250,128,16478.28,263740.42,230782.87,0.00,32957.55,8.43,0.00,0.00
251,128,16498.27,263950.32,230950.78,0.00,32999.54,8.43,0.00,0.00
252,128,16486.04,263810.70,230840.62,0.00,32970.09,8.43,0.00,0.00
253,128,16483.33,263722.35,230752.68,0.00,32969.67,8.43,0.00,0.00
254,128,16490.61,263801.69,230826.48,0.00,32975.21,8.43,0.00,0.00
255,128,16474.77,263642.36,230688.82,0.00,32953.55,8.43,0.00,0.00
256,128,16482.98,263704.67,230739.71,0.00,32964.96,8.43,0.00,0.00
257,128,16490.78,263826.52,230846.96,0.00,32979.57,8.43,0.00,0.00
258,128,16480.78,263662.48,230700.92,0.00,32961.56,8.43,0.00,0.00
259,128,16474.37,263699.00,230747.25,0.00,32951.75,8.43,0.00,0.00
260,128,16483.47,263635.59,230669.65,0.00,32965.95,8.43,0.00,0.00
261,128,16489.74,263947.88,230966.40,0.00,32981.48,8.43,0.00,0.00
262,128,16475.77,263583.29,230633.76,0.00,32949.54,8.43,0.00,0.00
263,128,16491.73,263763.60,230778.15,0.00,32985.45,8.43,0.00,0.00
264,128,16489.59,263954.41,230976.24,0.00,32978.17,8.43,0.00,0.00
265,128,16482.41,263723.57,230756.75,0.00,32966.82,8.43,0.00,0.00
266,128,16502.32,263982.19,230982.55,0.00,32999.65,8.43,0.00,0.00
267,128,16490.54,263921.69,230938.60,0.00,32983.09,8.43,0.00,0.00
268,128,16478.69,263587.10,230628.72,0.00,32958.39,8.43,0.00,0.00
269,128,16484.14,263827.24,230857.96,0.00,32969.28,8.43,0.00,0.00
270,128,16498.76,263908.21,230911.69,0.00,32996.53,8.43,0.00,0.00
271,128,16504.79,264077.66,231070.07,0.00,33007.58,8.43,0.00,0.00
272,128,16502.11,263981.78,230973.56,0.00,33008.22,8.43,0.00,0.00
273,128,16482.17,263786.71,230825.37,0.00,32961.34,8.43,0.00,0.00
274,128,16487.18,263750.96,230777.59,0.00,32973.37,8.43,0.00,0.00
275,128,16486.94,263823.12,230847.23,0.00,32975.89,8.43,0.00,0.00
276,128,16488.62,263813.85,230835.62,0.00,32978.23,8.43,0.00,0.00
277,128,16484.53,263776.53,230811.47,0.00,32965.07,8.43,0.00,0.00
278,128,16490.48,263887.65,230902.69,0.00,32984.96,8.43,0.00,0.00
279,128,16470.96,263565.38,230622.45,0.00,32942.92,8.43,0.00,0.00
280,128,16497.16,263889.56,230896.24,0.00,32993.32,8.43,0.00,0.00
281,128,16493.50,263882.03,230895.02,0.00,32987.00,8.43,0.00,0.00
282,128,16476.61,263671.70,230720.49,0.00,32951.21,8.43,0.00,0.00
283,128,16492.90,263839.34,230852.55,0.00,32986.79,8.43,0.00,0.00
284,128,16494.27,263952.34,230962.80,0.00,32989.54,8.43,0.00,0.00
285,128,16485.64,263773.26,230802.98,0.00,32970.28,8.43,0.00,0.00
286,128,16489.85,263759.62,230780.92,0.00,32978.70,8.43,0.00,0.00
287,128,16488.70,263797.18,230818.78,0.00,32978.40,8.43,0.00,0.00
288,128,16472.72,263602.54,230656.10,0.00,32946.44,8.43,0.00,0.00
289,128,16483.57,263823.11,230857.97,0.00,32965.14,8.43,0.00,0.00
290,128,16481.75,263610.02,230647.51,0.00,32962.50,8.43,0.00,0.00
291,128,16486.87,263814.98,230842.23,0.00,32972.75,8.43,0.00,0.00
292,128,16487.29,263781.71,230805.12,0.00,32976.59,8.43,0.00,0.00
293,128,16480.11,263714.73,230752.51,0.00,32962.22,8.43,0.00,0.00
294,128,16487.92,263837.79,230862.94,0.00,32974.85,8.43,0.00,0.00
295,128,16497.25,263872.02,230883.52,0.00,32988.50,8.43,0.00,0.00
296,128,16480.74,263770.87,230802.39,0.00,32968.48,8.43,0.00,0.00
297,128,16492.24,263825.86,230846.38,0.00,32979.48,8.43,0.00,0.00
298,128,16488.74,263753.84,230773.36,0.00,32980.48,8.43,0.00,0.00
299,128,16475.53,263713.43,230762.37,0.00,32951.05,8.43,0.00,0.00
300,128,16453.34,262793.36,229942.57,0.00,32850.79,8.43,0.00,0.00
SQL statistics:
    queries performed:
        read:                            69233878
        write:                           0
        other:                           9890554
        total:                           79124432
    transactions:                        4945277 (16482.98 per sec.)
    queries:                             79124432 (263727.76 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          300.0217s
    total number of events:              4945277

Latency (ms):
         min:                                    1.43
         avg:                                    7.76
         max:                                   99.91
         95th percentile:                        8.43
         sum:                             38387221.36

Threads fairness:
    events (avg/stddev):           38634.9766/925.23
    execution time (avg/stddev):   299.9002/0.01